#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tugrul/cv-iac/runs/run-RnijtKxtwkMwHQ3j

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.alaz: Refreshing state... [id=alaz]
github_branch_default.default: Refreshing state... [id=alaz]
github_branch_protection.staging: Refreshing state... [id=BPR_kwDOHTs4Gc4Bh2Ah]
github_branch.staging: Refreshing state... [id=alaz:staging]
github_branch_protection.main: Refreshing state... [id=BPR_kwDOHTs4Gc4Bh2Ak]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_sqs_queue.cv-content-queue will be created
  + resource "aws_sqs_queue" "cv-content-queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "cv-content-queue.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "environment"  = "production"
          + "generated_by" = "terraform-cloud"
          + "project"      = "cloud-challenge"
        }
      + tags_all                          = {
          + "environment"  = "production"
          + "generated_by" = "terraform-cloud"
          + "project"      = "cloud-challenge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # github_repository.alaz will be updated in-place
  ~ resource "github_repository" "alaz" {
        id                     = "alaz"
        name                   = "alaz"
      ~ vulnerability_alerts   = false -> true
        # (26 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @tugrulcan, Action: `pull_request`*